int_matrix.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope 
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<!-- http://www.w3.org/2003/05/soap-envelope -->
  <soapenv:Body>
    <m:intMatrixTest xmlns:m="org.scalabound.test"> 
      <matrix soapenv:arrayType="xsd:int[][2]">
	<item>
	        <item>3</item>
        	<item>4</item>
	</item>
	<item>
	        <item>5</item>
        	<item>6</item>
	</item>
      </matrix>
   </m:intMatrixTest> 
  </soapenv:Body>
</soapenv:Envelope>

